{
	"comments":"Comments are really just any unused tag",
	"clear":["tconstruct.modifiers.tools.ModAttack"],
	"clear":["tconstruct.modifiers.tools.ModToolRepair"],
	"clear":["tconstruct.modifiers.tools.ModRedstone"],
	"clearComment":"That was the clear tag. That's used to clear any existing modifiers with that class. Using an asterisk (*) will clear all modifiers.",
	"itemComment":"The other thing to note is that items are defined using a dictionary ({}). There, define 'item' using a string and 'damage' using either an int or a string for a wildcard. Stack size is ignored",
	"effects":"0 is diamond, 1 is emerald, 2 is redstone, 3 is piston, 4 is moss, 5 is some blue tinge, 6 is autosmelt and 7 is blaze",
	"effectsP2":"8 is necrotic, 9 is potato, 10 is lapis, 11 is quartz, 12 is silky, 13 is beheading, 14 is smite, 15 is arthropods",
	"effectsP3":"16 is reinforced, 17 is potato?, Don't go to 18",
	"colours":"0 is black, 1 is dark blue, 2 is dark green, 3 is dark aqua, 4 is dark red, 5 is dark purple, 6 is gold, 7 is gray, 8 is dark gray and 9 is blue",
	"coloursP2":"a is green, b is aqua, c is red, d is light purple, e is yellow and f is white",
	"addModifiers":[
		{
			"class":"org.abimon.mods.minecraft.tmodifiers.modifiers.ModCustomAttack",
			"params":[
				[
					{
						"item":"erebus:whetstone or sumthin"
					}
				],
				11,
				"Sharpness",
				2500,
				0.1f,
				0,
				"Sharpness",
				"ยง7"
			]
		},
		{
			"class":"org.abimon.mods.minecraft.tmodifiers.modifiers.ModCustomHaste",
			"params":[
				2,
				[
					{
						"item":"Thaumcraft:ItemShard",
						"damage":5
					},
					{
						"item":"Thaumcraft:blockCrystal",
						"damage":5
					}
				],
				[
					1,
					6
				],
				"ยง7Haste",
				50
			]
		},
		"In an addModifiers array, you're able to add a comment as just a string",
		"With the modifier we just added, we use an incrementing argument number, which corresponds to the position of the value, alternatively you can just use an array called params. These values can be obtained from the Modifers json file generated on startup"
	],
	"addModifierComment":"That was the Add Modifiers tag. The Add Modifiers array stores all modifiers to add to the internal registry.",
	"subModifiers":[
		"In a subModifiers array, you're able to add a comment as just a string",
		"With the modifier we just added, we use an incrementing argument number, which corresponds to the position of the value, alternatively you can just use an array called params. These values can be obtained from the Modifers json file generated on startup"
	],
	"subModifierComment":"That was the Sub Modifiers tag. The Sub Modifiers array stores all modifiers to subtract from the internal registry."
	modifierIncompatibilities:{
		"SilkTouchstacks":[
			"Reinforcedstacks"
			]

	}
}